Autodesk.Navisworks.Api.PropertyCategoryCollection
A collection of Autodesk.Navisworks.Api.PropertyCategory objects.

Autodesk.Navisworks.Api.PropertyCategoryCollection.FindCategoryByCombinedName(Autodesk.Navisworks.Api.NamedConstant)
Find first category with specified Autodesk.Navisworks.Api.PropertyCategory.CombinedName

Autodesk.Navisworks.Api.PropertyCategoryCollection.FindCategoryByDisplayName(System.String)
Find first category with specified Autodesk.Navisworks.Api.PropertyCategory.DisplayName

Autodesk.Navisworks.Api.PropertyCategoryCollection.FindCategoryByName(System.String)
Find first category with specified Autodesk.Navisworks.Api.PropertyCategory.Name

Autodesk.Navisworks.Api.PropertyCategoryCollection.FindCategoryWithStableId
Find first category with a stable id

Autodesk.Navisworks.Api.PropertyCategoryCollection.FindPropertyByCombinedName(Autodesk.Navisworks.Api.NamedConstant,Autodesk.Navisworks.Api.NamedConstant)
Find first property with specified Autodesk.Navisworks.Api.PropertyCategory.CombinedName
and Autodesk.Navisworks.Api.DataProperty.CombinedName

Autodesk.Navisworks.Api.PropertyCategoryCollection.FindPropertyByDisplayName(System.String,System.String)
Find first property with specified Autodesk.Navisworks.Api.PropertyCategory.DisplayName
and Autodesk.Navisworks.Api.DataProperty.DisplayName

Autodesk.Navisworks.Api.PropertyCategoryCollection.FindPropertyByName(System.String,System.String)
Find first property with specified Autodesk.Navisworks.Api.PropertyCategory.Name and Autodesk.Navisworks.Api.DataProperty.Name

Autodesk.Navisworks.Api.PropertyCategoryCollection.GetEnumerator
Returns an enumerator that can iterate through the collection.
Returns: An IEnumerator that can be used to iterate through the collection.

Autodesk.Navisworks.Api.PropertyCategoryCollection.IsReadOnly
Gets a value indicating whether the object is read-only.